### Terraform plan

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.identity_center_users.aws_identitystore_group_membership.memberships["test.user@example.com/my-test-power-users"] will be created
  + resource "aws_identitystore_group_membership" "memberships" {
      + group_id          = "c9be7428-9051-70c8-98bc-d46a2a4a6f0a"
      + id                = (known after apply)
      + identity_store_id = "d-9767aeefa5"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
      + region            = "ap-southeast-2"
    }

  # module.identity_center_users.aws_identitystore_user.users["test.user@example.com"] will be created
  + resource "aws_identitystore_user" "users" {
      + display_name      = "Test1 User2"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9767aeefa5"
      + region            = "ap-southeast-2"
      + user_id           = (known after apply)
      + user_name         = "test.user@example.com"

      + emails {
          + primary = true
          + value   = "test.user@example.com"
        }

      + name {
          + family_name = "User2"
          + given_name  = "Test1"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ user_ids        = {
      + "test.user@example.com"        = (known after apply)
        # (1 unchanged attribute hidden)
    }

```